no_partner_text = "Для продолжения пожалуйста подпишитесь на канал"

hello_text = """Добро пожаловать в 5 Likes🤪

Давай заполним твой профиль, это быстро😇

Как тебя зовут?🙈"""

enter_photo_text = "Приятно познакомиться, {name}! Теперь отправь мне свое фото, по которому тебя будут оценивать😋"

finish_reg_text = "Благодарим за регистрацию😇"
check_menu_text = "Ознакомься с меню и начинай получать оценки🤪"

help_text = """<i>Бот в котором реальные люди оценят твою привлекательность по фото от 1 до 5 баллов!</i>

Канал - @five_likes

Поддержка - @fivelikechatbot"""

error_ban_text = "Ваш профиль заблокирован"

all_top_text = "🏆 TOP все время:"
today_top_text = "🏆 TOP за сегодня:"

deactivate_profile_text = """Вы уверены, что хотите отключить анкету?
После этого она не будет показываться в боте!
Но вы в любое время можете возобновить показ"""

report_types = {"1": "18+", "2": "Оскорбление", "3": "Спам"}

send_sms_text = "Введите сообщение, которое хотите отправить"
finish_sms_text = "Ваше сообщение отправлено!"

premium_error_text = "Кажется, у вас нет премиум аккаунта"
back_premium_error_text = "Для продолжения выберите подходящий тариф:"
premium_info_text = """<b>Преимущества Premium:</b>

🔥 Больше оценок (x10)
💌 Отправление сообщений
🔙 Перемотка назад  
⛔️ Не тревожат рекламные рассылки
"""

have_premium_free_info_text = """<b>Premium подключён, действует до: {date}</b>

<i>Продлить ⤵</i>"""

pay_info_text = "Переходите по ссылке и оплачивайте"

what_gender_text = "Выберите пол, кого Вы будетео оценивать"

premium_free_info_text = """<b>Приглашай друзей по своей реферальной ссылке и получай Premium бесплатно!</b>

3 друга - 1 день Premium

<i>Приглашено: {count}</i>

Ваша реферальная ссылка:
<code>https://t.me/fivelikesbot?start={user_id}</code>"""

add_premium_free_text = "Вы получили один день Premium за 10-го реферала"

accept_ban_reporter_text = """{name}, провели проверку по Вашей жалобе, пользователь, нарушавший правила, заблокирован! 
Благодарим за бдительность♥️"""

accept_ban_user_text = "Вы заблокированы за нарушения"

ask_amnesty_text = "Вы нарушали наши правила, напишите ниже, по каким причинам мы должны вас разблокировать:"
send_ask_amnesty_text = "Запрос на амнистию отправлен"

bad_words = ["бля", "блять", "гандон", "гнида", "говно", "дроч", "еба", "ёба", "ёбн", "ёбы", "ёпт", "жопа", "залупа",
             "конч", "лох", "мразь", "мудак", "мудач", "педик", "пидор", "пидр", "пизд", "поскуд", "сать", "сосать",
             "сука", "уебан", "хер", "хуё", "хует", "хуит", "нахуй", "хуй", "хуя", "шалава", "шлюха", "/start",
             "Кто меня оценил❓", "👤 Мой профиль", "Premium🎗", "🏆 TOP", "Поддержка / О боте 💬"]
